{
  "fileFormatID": 163,
  "formatName": "Plain Text File",
  "version": null,
  "formatDescription": "Plain text files (also known by the extension 'TXT') consists of human-readable characters encoded sequentially in a particular \"character encoding\". The plain-text description in PRONOM provides a baseline identifier for all TXT (*.txt) files that may be identified by tools such as DROID. Plain text (x-fmt/111) cannot have a file format signature associated with it where other formats with 'txt' extensions will tend to. The character encoding of plain-text files may not be known upfront and is rarely indicated inline (in the file itself), but can be identified using additional tooling such as using the '-i' encoding flag in the UNIX/Linux 'file' command. Many human readable file-formats are built using plain-text as its foundation, and source code files, such as those written in Python, C++, or Java; or data structures saved to file, such as YAML or JSON, can be opened in text editors just as easily as .txt files. The primary difference between these structured files and plain-text is the structure that is may be encoded in the file and the format as implied by the file format extension.",
  "releaseDate": null,
  "withdrawnDate": null,
  "binaryFileFormat": "Text",
  "formatNote": "Further information and description credits can be found here: http://fileformats.archiveteam.org/wiki/Plain_text",
  "lastUpdatedDate": "15 Apr 2024",
  "formatSourceID": 1,
  "provenanceCompoundName": "Digital Preservation Department / The National Archives",
  "formatProvenance": "04/2024 (v.118)- Description and documentation links added. Submitted by Ross Spencer as part of PRONOM Research Week 2023.",
  "formatSourceDate": "02 Aug 2005",
  "formatDisclosure": null,
  "formatEnvironment": null,
  "formatRisk": null,
  "formatAliases": null,
  "formatTypes": null,
  "byteOrders": null,
  "formatFamilies": null,
  "identifiers": [
    {
      "identifierText": "text/plain",
      "identifierType": "MIME"
    },
    {
      "identifierText": "x-fmt/111",
      "identifierType": "PUID"
    }
  ],
  "internalSignatures": [],
  "externalSignatures": [
    {
      "externalSignature": "txt",
      "signatureType": "File extension"
    }
  ],
  "relationships": [],
  "source": 1
}